// 更新日志
export interface LogEntry {
    version: string;
    date: string;
    title?: string; // 可選的標題
    content: string[]; // 更新內容列表
    isCritical?: boolean; // 是否是重大更新（可用于 UI 标红）
}

export const changelogs: LogEntry[] = [
    {
        version: "v2.64.0_5",
        date: "2026-01-14",
        title: "功能更新以及BUG修复",
        content: [
            "修复：修复招式威力增強類的被動無法生效的問題。",
            "修复：修复鬥陣觸發類的被動無法生效的問題。",
            "新增：新增 [組隊模式]",
            "新增：新增頁面內容本地緩存",
            "优化：优化部分顯示",
        ],
        isCritical: true,
    },
    {
        version: "v2.64.0_4",
        date: "2026-01-06",
        title: "功能更新以及BUG修复",
        content: [
            "修复：修复極巨化拍組無法進入傷害計算界面的問題。",
            "新增：新增 [小遙&長耳兔] 拍組招式效果。",
            "新增：新增 [無衰減AOE] 類被動和招式的解析。",
            "优化：优化移动端石盘文字的显示",
        ],
        isCritical: true,
    },
    {
        version: "v2.64.0_3",
        date: "2026-01-05",
        title: "UI优化及功能更新",
        content: [
            "修复：修复 [聶凱&败露毒菇] 拍組招式效果解析失敗問題。",
            "修复：修复妨害效果類技能條件判斷不生效的問題",
            "修复：修复劇毒條件類技能判斷沒包含中毒的問題",
            "新增：新增 [特殊選項]  [拍組分類] [形態變化] 篩選條件。",
            "新增：篩選界面已支持排序。",
            "新增：[拍組資訊] 内容已添加",
            "新增：石盤界面新增 [學院拍組] 的滴晶計算",
        ],
        isCritical: true,
    },
    {
        version: "v2.64.0_2",
        date: "2025-12-31",
        title: "伤害计算数据更新",
        content: [
            "修复：修复伤害计算模块没有正确解析 [計量槽消耗增加威力提升] 类别。",
            "修复：被动 [小智的熱忱] 威力提升应与 [計量槽消耗增加威力提升] 类别一样为特殊乘算。",
            "修复：修复伤害计算遗漏 [太晶招式] 威力提升。",
        ],
        isCritical: true,
    },
    {
        version: "v2.64.0_1",
        date: "2025-12-31",
        title: "UI优化及功能更新",
        content: [
            "新增：增加目录模块，整合多页面入口。",
            "新增：筛选模块增加根据组队技能筛选。",
            "新增：伤害计算模块增加 [下降抗性] 选项。",
            "修复：修复伤害计算模块遗漏 [树果] 和 [技能使用次数] 选项。",
        ],
        isCritical: true,
    },
];
